## Missing Values

In [1]:
import numpy as np
import pandas as pd

In [2]:
dictData = {"Istanbul": [30, 29, np.nan], "Ankara": [20, np.nan, 25], "Izmir": [40, 39, 38]}

weatherDataFrame = pd.DataFrame(dictData)

In [3]:
weatherDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [4]:
weatherDataFrame.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [5]:
weatherDataFrame.dropna(axis= 1)

   Izmir
0     40
1     39
2     38

In [6]:
newdictData = {"Istanbul": [30, 29, np.nan], "Ankara": [20, np.nan, 25], "Izmir": [40, 39, 38], "Antalya": [45, np.nan, np.nan]}

newweatherDataFrame = pd.DataFrame(newdictData)

In [7]:
newweatherDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [8]:
newweatherDataFrame.dropna(axis= 1, thresh= 2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [9]:
newweatherDataFrame.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

## groupby

In [17]:
salaryDict = {"Department": ["Software", "Software", "Marketing", "Marketing", "Law", "Law"],
              "Employee Name": ["Utku", "Berfin", "Metin", "Osman", "Ali", "Sude"],
              "Salary": [100, 200, 300, 400, 500, 600]}

In [18]:
salaryDataFrame = pd.DataFrame(salaryDict)

In [19]:
salaryDataFrame

  Department Employee Name  Salary
0   Software          Utku     100
1   Software        Berfin     200
2  Marketing         Metin     300
3  Marketing         Osman     400
4        Law           Ali     500
5        Law          Sude     600

In [22]:
groupObject = salaryDataFrame.groupby("Department")

In [23]:
groupObject.count()

            Employee Name  Salary
Department
Law                     2       2
Marketing               2       2
Software                2       2

In [24]:
groupObject.mean()

            Salary
Department
Law          550.0
Marketing    350.0
Software     150.0

In [25]:
groupObject.min()

           Employee Name  Salary
Department
Law                  Ali     500
Marketing          Metin     300
Software          Berfin     100

In [26]:
groupObject.max()

           Employee Name  Salary
Department
Law                 Sude     600
Marketing          Osman     400
Software            Utku     200

In [27]:
groupObject.describe()

           Salary
            count   mean        std    min    25%    50%    75%    max
Department
Law           2.0  550.0  70.710678  500.0  525.0  550.0  575.0  600.0
Marketing     2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0
Software      2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0

## __concatenation__

#### for datasets with the same columns

#### _pd.concat([dataFrame1, dataFrame2, dataFrame3])_

## __merge__

#### for datasets with one or more different columns

#### _pd.merge(dataFrame1, dataFrame2, on= [common column name])

In [35]:
salaryDict2 = {"Name": ["Utku", "Berfin", "Osman", "Mehmet"],
               "Department": ["IT", "Sales", "Marketing", "IT"],
               "Salary": [200, 300, 400, 500]}

In [36]:
salaryDataFrame2 = pd.DataFrame(salaryDict2)

In [37]:
salaryDataFrame2

     Name Department  Salary
0    Utku         IT     200
1  Berfin      Sales     300
2   Osman  Marketing     400
3  Mehmet         IT     500

In [38]:
salaryDataFrame2["Department"].unique()

array(['IT', 'Sales', 'Marketing'], dtype=object)

In [39]:
salaryDataFrame2["Department"].nunique()

3

In [40]:
salaryDataFrame2["Department"].value_counts()

IT           2
Sales        1
Marketing    1
Name: Department, dtype: int64

In [44]:
def afterTaxes(salary):
    return salary * 0.66

In [45]:
salaryDataFrame2["Salary"].apply(afterTaxes)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Salary, dtype: float64

In [46]:
salaryDataFrame2.isnull()

    Name  Department  Salary
0  False       False   False
1  False       False   False
2  False       False   False
3  False       False   False

In [51]:
newData = {"Character Class": ["South Park", "South Park", "Simpson", "Simpson", "Simpson"],
           "Character Name" : ["Cartman", "Kenny", "Homer", "Bart", "Bart"],
           "Character Age"  : [9, 10, 50, 20, 10]}

In [52]:
characterDF = pd.DataFrame(newData)

In [53]:
characterDF

  Character Class Character Name  Character Age
0      South Park        Cartman              9
1      South Park          Kenny             10
2         Simpson          Homer             50
3         Simpson           Bart             20
4         Simpson           Bart             10

In [55]:
characterDF.pivot_table(values= "Character Age", index= ["Character Class", "Character Name"], aggfunc= np.sum)

                                Character Age
Character Class Character Name
Simpson         Bart                       30
                Homer                      50
South Park      Cartman                     9
                Kenny                      10

#### __Working with Excel__

##### _pd.read_excel("excel file name")_

##### _DataFrame.to_excel("file name")

##### if format is not .xlsx
##### read_csv("filename")
##### to_csv("filename")